// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
int MiddleDigit (int number)
{
   int dec = number / 10 % 10;
   return dec;
}
int randomNumber = new Random().Next(100,1000);
int newNumber = MiddleDigit(randomNumber);
*/

// Задача 13. Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

void int FindThirdDigit (number)
{
   int[] array = {0, array.Length};
   int n = array.Length;
   int index = 0;
   int third_digit = array[2];  
   {
      while (index < 2)
      {
         Concole.WriteLine("Here is no third digit of this number ");
         index++;
      }
      if (index == 2)
      {
         Console.WriteLine("Here is ");
      }
   }
}
   
Console.Wrire("Input a number: ");
int n = Convert.ToInt32(Console.ReadLine());
int n = FindThirdDigit(n):
Console.WriteLine()
